app/Models/Services/TripService.php

    public function get(array $filters = []): array
    {
        $db = \Config\Database::connect();

        // Query to fetch trip details
        $tripQuery = $db->table('v_trip_remaining_slots t')->join("v_trip_analytics a", "a.tripId = t.tripId");

        $fields = $this->filterTripFields($filters);

        foreach ($fields as $field => $value) {
            $tripQuery = $tripQuery->where("t.$field", $value);
        }

        $trip = $tripQuery->get()->getRowArray();

        if (!$trip) {
            return []; // Trip not found
        }

        $stepsQuery = $db->table('t_step')
        ->select('t_step.stepId, t_step.latitude, t_step.longitude, t_step.ordinal, t_step.name')
        ->where('t_step.tripId', $trip['tripId'])
        ->where('t_step.active', true)
        ->orderBy('t_step.ordinal', 'ASC')
        ->get();
---
SELECT `t_step`.`stepId`, `t_step`.`latitude`, `t_step`.`longitude`, `t_step`.`ordinal`, `t_step`.`name`
FROM `t_step`
WHERE `t_step`.`tripId` = '220'
AND `t_step`.`active` = 1
ORDER BY `t_step`.`ordinal` ASC