app/Controllers/Api.php

SELECT `t_accesses`.`userId`
FROM `t_accesses`
WHERE `token` = '1746644412.048e59394cf5292a8bdd5'
AND `active` = 1
AND `expiryDate` > '2025-05-07 20:06:47'
ORDER BY `loginDate` DESC
 LIMIT 1
---
    public function getTripsNearUser()
    {
        $data = json_decode(file_get_contents('php://input'), true);

        if (!isset($data['lat']) || !isset($data['lng'])) {
            return $this->response->setJSON([
                'error' => 'Invalid input. Please provide user coordinates.'
            ])->setStatusCode(400);
        }
        $userLat = (float)$data["lat"];
        $userLng = (float)$data['lng'];
        $token = $data['token'] ?? null;

        $userId = model(AccessesService::class)
            ->select("t_accesses.userId")
            ->where(['token' => $token, 'active' => true, "expiryDate >" => date("Y-m-d H:i:s")])
            ->orderBy("loginDate", "DESC")
            ->first();

SELECT `t_accesses`.`userId`
FROM `t_accesses`
WHERE `token` = '1746481405.0112aef0fb3a3d72e36d3'
AND `active` = 1
AND `expiryDate` > '2025-05-05 21:43:36'
ORDER BY `loginDate` DESC
 LIMIT 1
SELECT `t_car`.*
FROM `t_car`
WHERE `driverId` = '442'
AND `active` = 1
---
    public function getCars() {
        $data = json_decode(file_get_contents('php://input'), true);
        $token = $data['token'] ?? null;

        $userId = model(AccessesService::class)
            ->select("t_accesses.userId")
            ->where(['token' => $token, 'active' => true, "expiryDate >" => date("Y-m-d H:i:s")])
            ->orderBy("loginDate", "DESC")
            ->first();

        if (!$userId) {
            return $this->response->setJSON([
                'error' => 'Invalid token.'
            ])->setStatusCode(401);
        }

        $driver = model(DriverService::class)->get(['userId' => $userId, 'active' => true]);

        if (!$driver) {
            return $this->response->setJSON([
                'error' => 'Driver not found.'
            ])->setStatusCode(404);
        }
        $cars = model(CarService::class)->select('t_car.*')
            ->where(['driverId' => $driver->driverId, 'active' => true])->findAll();

SELECT `t_accesses`.`userId`
FROM `t_accesses`
WHERE `token` = '1746614143.6485a8d07eb94869ced34'
AND `active` = 1
AND `expiryDate` > '2025-05-07 10:36:36'
ORDER BY `loginDate` DESC
 LIMIT 1
---
    public function acceptPassenger() {
        $data = json_decode(file_get_contents('php://input'), true);
        $token = $data['token'] ?? null;
        $requestId = $data['requestId'] ?? null;
        $tripId = $data['tripId'] ?? null;

        $userId = model(AccessesService::class)
            ->select("t_accesses.userId")
            ->where(['token' => $token, 'active' => true, "expiryDate >" => date("Y-m-d H:i:s")])
            ->orderBy("loginDate", "DESC")
            ->first();

SELECT `t_accesses`.`userId`
FROM `t_accesses`
WHERE `token` = '1746829839.09220cf36c9b65264cd39'
AND `active` = 1
AND `expiryDate` > '2025-05-09 23:56:38'
ORDER BY `loginDate` DESC
 LIMIT 1
SELECT `t_request`.*, `t_user`.*
FROM `t_request`
JOIN `t_user` ON `t_request`.`userId` = `t_user`.`userId`
WHERE `tripId` = '225'
AND `t_request`.`active` = 1
AND `status` = 'PENDING'
---
    public function getRequestsForTrip() {
        $data = json_decode(file_get_contents('php://input'), true);
        $token = $data['token'] ?? null;
        $tripId = $data['tripId'] ?? null;

        $userId = model(AccessesService::class)
            ->select("t_accesses.userId")
            ->where(['token' => $token, 'active' => true, "expiryDate >" => date("Y-m-d H:i:s")])
            ->orderBy("loginDate", "DESC")
            ->first();

        if (!$userId) {
            return $this->response->setJSON([
                'error' => 'Invalid token.'
            ])->setStatusCode(400);
        }

        if (!$tripId) {
            return $this->response->setJSON([
                'error' => 'Invalid input. Please provide trip ID.'
            ])->setStatusCode(400);
        }

        $requests = model(RequestService::class)->select('t_request.*, t_user.*')->join('t_user', 't_request.userId = t_user.userId')
            ->where(['tripId' => $tripId, 't_request.active' => true, 'status' => 'PENDING'])->findAll();

SELECT `t_accesses`.`userId`
FROM `t_accesses`
WHERE `token` = '1746829839.09220cf36c9b65264cd39'
AND `active` = 1
AND `expiryDate` > '2025-05-09 23:56:36'
ORDER BY `loginDate` DESC
 LIMIT 1
---
    public function getPassengersOnBoardForTrip() {
        $data = json_decode(file_get_contents('php://input'), true);
        $token = $data['token'] ?? null;
        $tripId = $data['tripId'] ?? null;

        $userId = model(AccessesService::class)
            ->select("t_accesses.userId")
            ->where(['token' => $token, 'active' => true, "expiryDate >" => date("Y-m-d H:i:s")])
            ->orderBy("loginDate", "DESC")
            ->first();