app/Controllers/Homepage.php

    public function index()
    {
        $user = AuthHelper::getAuthenticatedUser();
        $driver = AuthHelper::getAuthenticatedDriver($user, false);

        $activeTrip = model(TripService::class)->get(["driverId" => $driver->driverId, "active" => true, "status" => ApplicationConstants::$TRIP_STATUS["STARTED"], "actualEndTime" => null]);
        $request = model(RequestService::class)->select("t_request.*")->where([
            'userId' => $user->userId,
            'active' => true,
            'status' => "PENDING",
        ])->first();
---
SELECT `t_request`.*
FROM `t_request`
WHERE `userId` = '1'
AND `active` = 1
AND `status` = 'PENDING'
 LIMIT 1