app/Models/ApplicationUtilities.php

    public static function verifyAuth(): ?object
    {
        $session = session();

        if ($session->has("userId")) {
            $access = model(AccessesService::class)->select("t_accesses.*")->where([
                'userId' => $session->get("userId"),
                'active' => true,
                'expiryDate >' => (new DateTime())->format('Y-m-d H:i:s')
            ])->orderBy("loginDate", "DESC")->first();
---
SELECT `t_accesses`.*
FROM `t_accesses`
WHERE `userId` = '77'
AND `active` = 1
AND `expiryDate` > '2025-05-09 23:56:41'
ORDER BY `loginDate` DESC
 LIMIT 1

    public static function logout()
    {
        $session = session();

        try {
            $user = static::verifyAuth();

            if ($user) {
                model(AccessesService::class)->delete(['userId' => $user->userId, 'active' => true]);
---
DELETE FROM `t_accesses`
WHERE `accessId` IN ('77',1)